ERP DEV.WMS/src/Catalogs/вмс_НаборыДополнительныхРеквизитов/вмс_НаборыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НаборыДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
        <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
        <types>CatalogRef.вмс_Операции</types>
        <types>CatalogRef.вмс_ВидыПартийТоваров</types>
        <types>CatalogRef.вмс_НастройкиОператора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_УправлениеСвойствамиВызовСервера/Module.bsl
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция НайтиНаборДополнительныхРеквизитовПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев=Истина) Экспорт
	Возврат Справочники.вмс_НаборыДополнительныхРеквизитов.НайтиНаборПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев);
КонецФункции

Функция НайтиНаборыДополнительныхРеквизитовПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев=Истина) Экспорт
	Возврат Справочники.вмс_НаборыДополнительныхРеквизитов.НайтиНаборыПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев);
КонецФункции

Функция ИспользоватьДополнительныеРеквизитыОбъекта(Владелец) Экспорт

	ТипВладельца = ТипЗнч(Владелец);
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипВладельца);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не Метаданные.Справочники.Содержит(МетаданныеОбъекта) И Не Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если МетаданныеОбъекта.ТабличныеЧасти.Найти("ДополнительныеРеквизиты") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипыВладельцев = Метаданные.Справочники.вмс_НаборыДополнительныхРеквизитов.ТабличныеЧасти.Владельцы.Реквизиты.Владелец.Тип.Типы();
	Если ТипыВладельцев.Найти(ТипВладельца) = Неопределено Тогда
		РК = глОбщийМодуль("РаботаСКоллекциями");
		РеквизитыВладельцев = вмс_УправлениеСвойствамиВызовСервераПовтИсп.ПолучитьРеквизитыВладельцевДополнительныхРеквизитов(Владелец);
		Для Каждого РеквизитВладельца Из РеквизитыВладельцев Цикл
			МетаданныеРеквизитаВладельца = МетаданныеОбъекта.Реквизиты.Найти(РеквизитВладельца);
			Если РК.ПересечениеМассивов(ТипыВладельцев, МетаданныеРеквизитаВладельца.Тип.Типы()).Количество() > 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция УстановитьЗначенияДополнительныхРеквизитовОбъекта(Объект, ДополнительныеРеквизиты) Экспорт

	Перем УправлениеСвойствамиСервер;
	
	ТаблицаДополнительныхРеквизитов = Новый ТаблицаЗначений;
	ТаблицаДополнительныхРеквизитов.Колонки.Добавить("ИмяСвойства");
	ТаблицаДополнительныхРеквизитов.Колонки.Добавить("Свойство");
	ТаблицаДополнительныхРеквизитов.Колонки.Добавить("Значение");
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		
		Для Каждого Реквизит Из ДополнительныеРеквизиты Цикл
			НоваяСтрокаРеквизита = ТаблицаДополнительныхРеквизитов.Добавить();
			НоваяСтрокаРеквизита.ИмяСвойства = Реквизит.Ключ;
			НоваяСтрокаРеквизита.Значение = Реквизит.Значение;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДополнительныеРеквизиты) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого СтрокаРеквизита Из ДополнительныеРеквизиты Цикл
			НоваяСтрокаРеквизита = ТаблицаДополнительныхРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизита, СтрокаРеквизита);
		КонецЦикла;
		
	КонецЕсли;
	
	МассивСтрокНайтиСсылкиСвойств = Новый Массив;
	МассивСтрокУдалить = Новый Массив;
	Для Каждого СтрокаРеквизита Из ТаблицаДополнительныхРеквизитов Цикл
		Если Не ЗначениеЗаполнено(СтрокаРеквизита.Свойство) Тогда
			Если Не ЗначениеЗаполнено(СтрокаРеквизита.ИмяСвойства) Тогда
				МассивСтрокУдалить.Добавить(СтрокаРеквизита);
			Иначе
				МассивСтрокНайтиСсылкиСвойств.Добавить(СтрокаРеквизита);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокНайтиСсылкиСвойств.Количество() > 0 Тогда
		УправлениеСвойствамиСервер = глОбщийМодуль("УправлениеСвойствамиСервер");
		ТаблицаДополнительныхРеквизитовЗапрос = УправлениеСвойствамиСервер.ПолучитьТаблицуДополнительныхРеквизитовОбъектов(Объект);
		Для Каждого СтрокаРеквизита Из МассивСтрокНайтиСсылкиСвойств Цикл
			НайденныеСтрокиРеквизита = ТаблицаДополнительныхРеквизитовЗапрос.НайтиСтроки(Новый Структура("ИмяСвойства", СтрокаРеквизита.ИмяСвойства));
			Если НайденныеСтрокиРеквизита.Количество() > 0 Тогда
				СтрокаРеквизита.Свойство = НайденныеСтрокиРеквизита[0].Свойство;
			Иначе
				МассивСтрокУдалить.Добавить(СтрокаРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для Каждого СтрокаУдалить Из МассивСтрокУдалить Цикл
		ТаблицаДополнительныхРеквизитов.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	Если ТаблицаДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаДополнительныхРеквизитовПриемник = Объект.ДополнительныеРеквизиты;
	Для Каждого СтрокаРеквизита Из ТаблицаДополнительныхРеквизитов Цикл
		НайденныеСтрокиРеквизитаПриемника = ТаблицаДополнительныхРеквизитовПриемник.НайтиСтроки(Новый Структура("Свойство", СтрокаРеквизита.Свойство));
		Если НайденныеСтрокиРеквизитаПриемника.Количество() > 0 Тогда
			СтрокаРеквизитаПриемника = НайденныеСтрокиРеквизитаПриемника[0];
		Иначе
			СтрокаРеквизитаПриемника = ТаблицаДополнительныхРеквизитовПриемник.Добавить();
			СтрокаРеквизитаПриемника.Свойство = СтрокаРеквизита.Свойство;
		КонецЕсли;
		СтрокаРеквизитаПриемника.Значение = СтрокаРеквизита.Значение;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция ПолучитьИменаОбъектовДополнительныхРеквизитов() Экспорт
	
	ИменаОбъектов = Новый Массив;
	ИменаОбъектов.Добавить("Справочник.вмс_НаборыДополнительныхРеквизитов");
	ИменаОбъектов.Добавить("ПланВидовХарактеристик.вмс_ДополнительныеРеквизиты");
	ИменаОбъектов.Добавить("Справочник.вмс_ЗначенияСвойствОбъектов");
	
	Возврат ИменаОбъектов;
	
КонецФункции

Функция ПолучитьСсылкиОбъектовДополнительныхРеквизитов() Экспорт
	
	ТекстЗапроса = "";
	Разделитель = Символы.ПС + Символы.ПС + " ОБЪЕДИНИТЬ " + Символы.ПС + Символы.ПС;
	
	Для Каждого ИмяОбъекта Из ПолучитьИменаОбъектовДополнительныхРеквизитов() Цикл
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + Разделитель;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ Ссылка ИЗ " + ИмяОбъекта;
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция ПолучитьТаблицуДополнительныхРеквизитовОбъекта(Объект) Экспорт

	ТаблицаРеквизитов = глОбщийМодуль("УправлениеСвойствамиСервер").ПолучитьТаблицуДополнительныхРеквизитовОбъекта(Объект);
	
	КвазиТаблицаРеквизитов = глОбщийМодуль("РаботаСКоллекциями").НоваяКвазиТаблицаЗначений(ТаблицаРеквизитов);
	
	Возврат КвазиТаблицаРеквизитов;
	
КонецФункции

Функция ПолучитьЗначенияДополнительныхРеквизитовОбъекта(Объект) Экспорт
	
	ТаблицаРеквизитов = глОбщийМодуль("УправлениеСвойствамиСервер").ПолучитьТаблицуДополнительныхРеквизитовОбъекта(Объект);
	
	ЗначенияРеквизитов = Новый Структура;
	Для Каждого Реквизит Из ТаблицаРеквизитов Цикл
		ЗначенияРеквизитов.Вставить(Реквизит.ИмяСвойства, Реквизит.ЗначениеСвойства);
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции
Функция ПолучитьДанныеФормыДополнительныхРеквизитовОбъекта(ДанныеФормы, СсылкаНаОбъект) Экспорт
	
	ЗначениеВДанныеФормы(ПолучитьНаборДополнительныхРеквизитовОбъекта(СсылкаНаОбъект), ДанныеФормы);
	
КонецФункции

Функция ПолучитьНаборДополнительныхРеквизитовОбъекта(СсылкаНаОбъект) Экспорт

	СсылкаНаНаборДополнительныхРеквизитов = НайтиНаборДополнительныхРеквизитовПоВладельцу(СсылкаНаОбъект);
	Если СсылкаНаНаборДополнительныхРеквизитов <> Неопределено Тогда
		НаборДополнительныхРеквизитов = СсылкаНаНаборДополнительныхРеквизитов.ПолучитьОбъект();
	Иначе
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаОбъект));
		НаборДополнительныхРеквизитов = Справочники.вмс_НаборыДополнительныхРеквизитов.СоздатьЭлемент();
		НаборДополнительныхРеквизитов.Наименование = МетаданныеОбъекта.Синоним + " """ + Строка(СсылкаНаОбъект) + """";
		НаборДополнительныхРеквизитов.Владельцы.Добавить().Владелец = СсылкаНаОбъект;
	КонецЕсли;
	
	Возврат НаборДополнительныхРеквизитов;
	
КонецФункции
